Tekla Open API Reference for Tekla Structures 2025
Detail.SetReferencePoint Method
 Sets the reference point; the point the user would pick for the detail to appear to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetReferencePoint(
	Point ReferencePoint
)
Public Function SetReferencePoint (
	ReferencePoint As Point
) As Boolean
Parameters
ReferencePoint
Type: Tekla.Structures.Geometry3d.Point
The reference point.
Return Value
Type: Boolean
True on success.
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace